lavendy/esp32-camera/sensors/gc0307.c
// Copyright 2015-2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "sccb.h"
#include "gc0307.h"
#include "gc0307_regs.h"
#include "gc0307_settings.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#else
#include "esp_log.h"
static const char *TAG = "gc0307";
#endif

#define H8(v) ((v)>>8)
#define L8(v) ((v)&0xff)

//#define REG_DEBUG_ON

static int read_reg(uint8_t slv_addr, const uint16_t reg)
{
    int ret = SCCB_Read(slv_addr, reg);
#ifdef REG_DEBUG_ON
    if (ret < 0) {
        ESP_LOGE(TAG, "READ REG 0x%04x FAILED: %d", reg, ret);
    }
#endif
    return ret;
}

static int write_reg(uint8_t slv_addr, const uint16_t reg, uint8_t value)
{
    int ret = 0;
#ifndef REG_DEBUG_ON
    ret = SCCB_Write(slv_addr, reg, value);
#else
    int old_value = read_reg(slv_addr, reg);
    if (old_value < 0) {
        return old_value;
    }
    if ((uint8_t)old_value != value) {
        ESP_LOGI(TAG, "NEW REG 0x%04x: 0x%02x to 0x%02x", reg, (uint8_t)old_value, value);
        ret = SCCB_Write(slv_addr, reg, value);
    } else {
        ESP_LOGD(TAG, "OLD REG 0x%04x: 0x%02x", reg, (uint8_t)old_value);
        ret = SCCB_Write(slv_addr, reg, value);//maybe not?
    }
    if (ret < 0) {
        ESP_LOGE(TAG, "WRITE REG 0x%04x FAILED: %d", reg, ret);
    }
#endif
    return ret;
}

static int check_reg_mask(uint8_t slv_addr, uint16_t reg, uint8_t mask)
{
    return (read_reg(slv_addr, reg) & mask) == mask;
}

static int set_reg_bits(uint8_t slv_addr, uint16_t reg, uint8_t offset, uint8_t mask, uint8_t value)
{
    int ret = 0;
    uint8_t c_value, new_value;
    ret = read_reg(slv_addr, reg);
    if (ret < 0) {
        return ret;
    }
    c_value = ret;
    new_value = (c_value & ~(mask << offset)) | ((value & mask) << offset);
    ret = write_reg(slv_addr, reg, new_value);
    return ret;
}

static int write_regs(uint8_t slv_addr, const uint8_t (*regs)[2], size_t regs_size)
{
    int i = 0, ret = 0;
    while (!ret && (i < regs_size)) {
        if (regs[i][0] == REG_DLY) {
            vTaskDelay(regs[i][1] / portTICK_PERIOD_MS);
        } else {
            ret = write_reg(slv_addr, regs[i][0], regs[i][1]);
        }
        i++;
    }
    return ret;
}

static void print_regs(uint8_t slv_addr)
{
#ifdef DEBUG_PRINT_REG
    ESP_LOGI(TAG, "REG list look ======================");
    for (size_t i = 0xf0; i <= 0xfe; i++) {
        ESP_LOGI(TAG, "reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
    ESP_LOGI(TAG, "\npage 0 ===");
    write_reg(slv_addr, 0xf0, 0x00); // page 0
    for (size_t i = 0x00; i <= 0x1f; i++) {
        ESP_LOGI(TAG, "p0 reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
	for (size_t i = 0x40; i <= 0x4f; i++) {
        ESP_LOGI(TAG, "p0 ISP reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
#endif
}

static int reset(sensor_t *sensor)
{
    int ret = 0;
    // Software Reset: clear all registers and reset them to their default values
    /*ret = write_reg(sensor->slv_addr, RESET_RELATED, 0xf0);
    if (ret) {
        ESP_LOGE(TAG, "Software Reset FAILED!");
        return ret;
    }*/
	ESP_LOGI(TAG, "GC0307 not supported Software Reset!");
	ESP_LOGI(TAG, "start re-init process");

    vTaskDelay(80 / portTICK_PERIOD_MS);
    ret = write_regs(sensor->slv_addr, gc0307_sensor_default_regs, sizeof(gc0307_sensor_default_regs)/(sizeof(uint8_t) * 2));
    if (ret == 0) {
        ESP_LOGD(TAG, "Camera defaults loaded");
        vTaskDelay(80 / portTICK_PERIOD_MS);
        ret = write_reg(sensor->slv_addr, 0xf0, 0x00);
		ret |= write_reg(sensor->slv_addr, 0x43, 0x40); //set o_pclk_output enable
		ret |= write_reg(sensor->slv_addr, 0x44, 0xE1); //output mode, E1 = 1110 0001
		/*
		Output mode setting:total data bus width [9:0]
		[7] reserved
		[6] output enable, reset value is 0, that
		is hight-z
		[5] averaging neighbors croma
		[4] output o_pclk select
		[3:0] output bus data type setting
			0x00: CbYCr Y
			0x01: CrYCbY
			0x02: YCbYCr
			0x03: YCrYCb
			0x04:reserved
			0x05:reserved
			0x06: RGB 565
			0x07: RGB x555
			0x08: RGB 555x
			0x09: RGB x444
			0x0a: RGB 444x
			0x0b: BGRG
			0x0c: RGBG
			0x0d: GBGR
			0x0e: GRGB
			0x11: only Y
			0x12: only Cb
			0x13: only Cr
			0x14: only R
			0x15: only G
			0x16: only B
		*/
#ifdef CONFIG_IDF_TARGET_ESP32
        //ret |= set_reg_bits(sensor->slv_addr, PCLK_DIV, 4, 0x07, 1);  //frequency division for esp32, ensure pclk <= 15MHz
#endif
    }
    return ret;
}

static int set_pixformat(sensor_t *sensor, pixformat_t pixformat)
{
    int ret = 0;

	/*
	YUV422 YUYV	0xE2	enable + chroma + YCbYCr
	RGB565	0x46		enable + RGB565
	GRAYSCALE	0x51	enable + only Y*/
    switch (pixformat) {
	case PIXFORMAT_RGB565:
		ret = write_reg(sensor->slv_addr, 0xf0, 0x00);   // page 0
		ret |= write_reg(sensor->slv_addr, OUTPUT_FMT, 0x46);
		// 0x46 = 0100 0110
		// bit6 = 1 (enable)
		// bit5 = 0
		// bit[3:0] = 0x06 (RGB565)
		break;

	case PIXFORMAT_YUV422:
		ret = write_reg(sensor->slv_addr, 0xf0, 0x00);
		ret |= write_reg(sensor->slv_addr, OUTPUT_FMT, 0xE2);
		// YUV422 YCbYCr (기존 테이블과 동일)
		break;

	case PIXFORMAT_GRAYSCALE:
		ret = write_reg(sensor->slv_addr, 0xf0, 0x00);
		ret |= write_reg(sensor->slv_addr, OUTPUT_FMT, 0x51);
		// 0x51 = 0101 0001
		// bit6 = 1 (enable)
		// bit5 = 0 (chroma off)
		// bit[4:0] = 0x11 (only Y)
		break;
    default:
        ESP_LOGW(TAG, "Unsupported format %u", pixformat);
        ret = -1;
        break;
    }

    if (ret == 0) {
        sensor->pixformat = pixformat;
        ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
    }
    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;
    if (framesize > FRAMESIZE_VGA) {
        ESP_LOGW(TAG, "Invalid framesize: %u", framesize);
        framesize = FRAMESIZE_VGA;
    }
    sensor->status.framesize = framesize;
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    uint16_t row_s = (resolution[FRAMESIZE_VGA].height - h) / 2;
    uint16_t col_s = (resolution[FRAMESIZE_VGA].width - w) / 2;
    (void)row_s;
    (void)col_s;

