lavendy/esp32-camera/sensors/gc0307.c
#if CONFIG_GC_SENSOR_SUBSAMPLE_MODE
    struct subsample_cfg {
        uint16_t ratio_numerator;
        uint16_t ratio_denominator;
        uint8_t reg0x54;
        uint8_t reg0x56;
        uint8_t reg0x57;
        uint8_t reg0x58;
        uint8_t reg0x59;
    };
    const struct subsample_cfg subsample_cfgs[] = { // define some subsample ratio
        {84, 420, 0x55, 0x00, 0x00, 0x00, 0x00}, //1/5
        {105, 420, 0x44, 0x00, 0x00, 0x00, 0x00},//1/4
        {140, 420, 0x33, 0x00, 0x00, 0x00, 0x00},//1/3
        {210, 420, 0x22, 0x00, 0x00, 0x00, 0x00},//1/2
        {240, 420, 0x77, 0x02, 0x46, 0x02, 0x46},//4/7
        {252, 420, 0x55, 0x02, 0x04, 0x02, 0x04},//3/5
        {280, 420, 0x33, 0x02, 0x00, 0x02, 0x00},//2/3
        {420, 420, 0x11, 0x00, 0x00, 0x00, 0x00},//1/1
    };
    uint16_t win_w = 640;
    uint16_t win_h = 480;
    const struct subsample_cfg *cfg = NULL;
    
    //Strategy: try to keep the maximum perspective
     
    for (size_t i = 0; i < sizeof(subsample_cfgs) / sizeof(struct subsample_cfg); i++) {
        cfg = &subsample_cfgs[i];
        if ((win_w * cfg->ratio_numerator / cfg->ratio_denominator >= w) && (win_h * cfg->ratio_numerator / cfg->ratio_denominator >= h)) {
            win_w = w * cfg->ratio_denominator / cfg->ratio_numerator;
            win_h = h * cfg->ratio_denominator / cfg->ratio_numerator;
            row_s = (resolution[FRAMESIZE_VGA].height - win_h) / 2;
            col_s = (resolution[FRAMESIZE_VGA].width - win_w) / 2;
            ESP_LOGI(TAG, "subsample win:%dx%d, ratio:%f", win_w, win_h, (float)cfg->ratio_numerator / (float)cfg->ratio_denominator);
            break;
        }
    }

    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);

    ret |= write_reg(sensor->slv_addr, ROW_START_H, H8(row_s));
    ret |= write_reg(sensor->slv_addr, ROW_START_L, L8(row_s));
    ret |= write_reg(sensor->slv_addr, COL_START_H, H8(col_s));
    ret |= write_reg(sensor->slv_addr, COL_START_L, L8(col_s));
    ret |= write_reg(sensor->slv_addr, WIN_HEIGHT_H, H8(win_h + 8));
    ret |= write_reg(sensor->slv_addr, WIN_HEIGHT_L, L8(win_h + 8));
    ret |= write_reg(sensor->slv_addr, WIN_WIDTH_H, H8(win_w + 8));
    ret |= write_reg(sensor->slv_addr, WIN_WIDTH_L, L8(win_w + 8));

    ret |= write_reg(sensor->slv_addr, 0xfe, 0x01);
    ret |= set_reg_bits(sensor->slv_addr, SUBSAMPLE_EN, 7, 0x01, 1);
    ret |= set_reg_bits(sensor->slv_addr, SUBSAMPLE_EN2, 0, 0x01, 1);
    ret |= write_reg(sensor->slv_addr, SUBSAMPLE_MODE, cfg->reg0x54);
    ret |= write_reg(sensor->slv_addr, SUBSAMPLE_Y0, cfg->reg0x56);
    ret |= write_reg(sensor->slv_addr, SUBSAMPLE_Y1, cfg->reg0x57);
    ret |= write_reg(sensor->slv_addr, SUBSAMPLE_UV0, cfg->reg0x58);
    ret |= write_reg(sensor->slv_addr, SUBSAMPLE_UV1, cfg->reg0x59);

    ret |= write_reg(sensor->slv_addr, 0xfe, 0x00);

#elif CONFIG_GC_SENSOR_WINDOWING_MODE
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);

    ret |= write_reg(sensor->slv_addr, SUB_COL_N, col_s / 4);
    ret |= write_reg(sensor->slv_addr, SUB_ROW_N, row_s / 4);
    ret |= write_reg(sensor->slv_addr, SUB_COL_N1, (col_s + w) / 4);
    ret |= write_reg(sensor->slv_addr, SUB_ROW_N1, (row_s + h) / 4);

    ret |= write_reg(sensor->slv_addr, ROW_START_H, H8(row_s));
    ret |= write_reg(sensor->slv_addr, ROW_START_L, L8(row_s));
    ret |= write_reg(sensor->slv_addr, COL_START_H, H8(col_s));
    ret |= write_reg(sensor->slv_addr, COL_START_L, L8(col_s));

    ret |= write_reg(sensor->slv_addr, WIN_HEIGHT_H, H8(h + 8));
    ret |= write_reg(sensor->slv_addr, WIN_HEIGHT_L, L8(h + 8));
    ret |= write_reg(sensor->slv_addr, WIN_WIDTH_H, H8(w + 8));
    ret |= write_reg(sensor->slv_addr, WIN_WIDTH_L, L8(w + 8));

#endif
    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    return 0;
}

static int set_contrast(sensor_t *sensor, int level)
{
    int ret = 0;
    // GC0307 contrast range: -2 to +2 (mapped to register values)
    if (level < -2 || level > 2) {
        return -1;
    }
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // Adjust contrast (CONTRAST register)
    // Default value is 0x40, adjust based on level
    uint8_t contrast_val = 0x40 + (level * 0x10);
    ret |= write_reg(sensor->slv_addr, CONTRAST, contrast_val);
    if (ret == 0) {
        sensor->status.contrast = level;
        ESP_LOGD(TAG, "Set contrast to: %d", level);
    }
    return ret;
}

static int set_saturation(sensor_t *sensor, int level)
{
    int ret = 0;
    // GC0307 saturation range: -2 to +2
    if (level < -2 || level > 2) {
        return -1;
    }
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // Adjust saturation via Cb and Cr saturation gains (0xb1, 0xb2)
    // Default values from settings: both 0x40
    // Saturation adjustment: increase/decrease both Cb and Cr gains
    uint8_t sat_val = 0x40 + (level * 0x10);
    ret |= write_reg(sensor->slv_addr, SATURATION_Cb, sat_val);
    ret |= write_reg(sensor->slv_addr, SATURATION_Cr, sat_val);
    if (ret == 0) {
        sensor->status.saturation = level;
        ESP_LOGD(TAG, "Set saturation to: %d", level);
    }
    return ret;
}

static int set_sharpness(sensor_t *sensor, int level)
{
    int ret = 0;
    // GC0307 sharpness control via Edge Enhancement registers (0x77-0x79)
    // Per Linux kernel driver: EDGE12_EFFECT, EDGE_POS_RATIO, EDGE1_MINMAX
    // Range: -2 to +2
    if (level < -2 || level > 2) {
        return -1;
    }
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // Adjust edge enhancement effect
    // Default values from Linux kernel driver: 0x38, 0x88 (Page 0)
    // Increase for more sharpness, decrease for softer image
    uint8_t edge_effect = 0x38 + (level * 0x08);
    uint8_t edge_ratio = 0x88 + (level * 0x08);
    ret |= write_reg(sensor->slv_addr, EDGE12_EFFECT, edge_effect);
    ret |= write_reg(sensor->slv_addr, EDGE_POS_RATIO, edge_ratio);
    // EDGE1_MINMAX typically kept at default unless fine-tuning needed
    if (ret == 0) {
        sensor->status.sharpness = level;
        ESP_LOGD(TAG, "Set sharpness to: %d (edge enhancement)", level);
    }
    return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= set_reg_bits(sensor->slv_addr, OUT_CTRL, 0, 0x01, enable);
    if (ret == 0) {
        sensor->status.colorbar = enable;
        ESP_LOGD(TAG, "Set colorbar to: %d", enable);
    }
    return ret;
}

static int set_whitebal(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // AWB enable/disable via AAAA_EN register, AWB_ENABLE bit
    ret |= set_reg_bits(sensor->slv_addr, AAAA_EN, 1, 0x01, enable != 0);
    if (ret == 0) {
        sensor->status.awb = enable;
        ESP_LOGD(TAG, "Set AWB to: %d", enable);
    }
    return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // AGC enable/disable via AAAA_EN register, AGC_ENABLE bit
    ret |= set_reg_bits(sensor->slv_addr, AAAA_EN, 2, 0x01, enable != 0);
    if (ret == 0) {
        sensor->status.agc = enable;
        ESP_LOGD(TAG, "Set AGC to: %d", enable);
    }
    return ret;
}

