lavendy/esp32-camera/sensors/gc0307.c
static int set_ae_level(sensor_t *sensor, int level)
{
    int ret = 0;
    // AE level range: -2 to +2
    if (level < -2 || level > 2) {
        return -1;
    }
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    // Adjust AE target via AEC_TARGET_Y register (Page 0, 0xd3)
    // This is the expected luminance value for AEC
    // Default is 0x48, adjust based on level
    uint8_t ae_target = 0x48 + (level * 0x08);
    ret |= write_reg(sensor->slv_addr, AEC_TARGET_Y, ae_target);
    if (ret == 0) {
        sensor->status.ae_level = level;
        ESP_LOGD(TAG, "Set AE level to: %d", level);
    }
    return ret;
}

static int get_reg(sensor_t *sensor, int reg, int mask)
{
    int ret = 0;
    if (mask > 0xFF) {
        ESP_LOGE(TAG, "mask should not more than 0xff");
    } else {
        ret = read_reg(sensor->slv_addr, reg);
    }
    if (ret > 0) {
        ret &= mask;
    }
    return ret;
}

static int set_reg(sensor_t *sensor, int reg, int mask, int value)
{
    int ret = 0;
    if (mask > 0xFF) {
        ESP_LOGE(TAG, "mask should not more than 0xff");
    } else {
        ret = read_reg(sensor->slv_addr, reg);
    }
    if (ret < 0) {
        return ret;
    }
    value = (ret & ~mask) | (value & mask);

    if (mask > 0xFF) {

    } else {
        ret = write_reg(sensor->slv_addr, reg, value);
    }
    return ret;
}

static int init_status(sensor_t *sensor)
{
    int ret;
    ret = write_reg(sensor->slv_addr, 0xf0, 0x00);

    // Read contrast from CONTRAST register (0xa1)
    // Default is 0x40, map back to level: (reg_val - 0x40) / 0x10
    /*ret = read_reg(sensor->slv_addr, CONTRAST);
    if (ret >= 0) {
        int contrast_level = (ret - 0x40) / 0x10;
        sensor->status.contrast = (contrast_level < -2) ? -2 : (contrast_level > 2) ? 2 : contrast_level;
    } else {
        sensor->status.contrast = 0;
    }*/
	sensor->status.contrast = 0;

    // Read saturation from SATURATION_Cb register (0xa2)
    // Default is 0x48, map back to level: (reg_val - 0x48) / 0x10
    /*ret = read_reg(sensor->slv_addr, SATURATION_Cb);
    if (ret >= 0) {
        int saturation_level = (ret - 0x48) / 0x10;
        sensor->status.saturation = (saturation_level < -2) ? -2 : (saturation_level > 2) ? 2 : saturation_level;
    } else {
        sensor->status.saturation = 0;
    }*/
	sensor->status.saturation = 0;

    // Read sharpness from EDGE12_EFFECT register (0x77)
    // GC0307 uses Edge Enhancement registers for sharpness control
    // Linux kernel driver uses 0x38 as default
    /*ret = read_reg(sensor->slv_addr, EDGE12_EFFECT);
    if (ret >= 0) {
        int sharpness_level = (ret - 0x38) / 0x08;
        sensor->status.sharpness = (sharpness_level < -2) ? -2 : (sharpness_level > 2) ? 2 : sharpness_level;
    } else {
        sensor->status.sharpness = 0;
    }*/
	sensor->status.sharpness = 0;

    // Denoise not supported by GC0307
    sensor->status.denoise = 0;

    // Read AE level from AEC_TARGET_Y register (P0:0xd3)
    // Same register as brightness, but different step size for level calculation
    /*ret = read_reg(sensor->slv_addr, AEC_TARGET_Y);
    if (ret >= 0) {
        int ae_level = (ret - 0x48) / 0x08;
        sensor->status.ae_level = (ae_level < -2) ? -2 : (ae_level > 2) ? 2 : ae_level;
    } else {
        sensor->status.ae_level = 0;
    }*/
	sensor->status.ae_level = 0;

    // Gainceiling not supported by GC0307
    sensor->status.gainceiling = 0;

    // Read AWB, AGC, AEC status from AAAA_EN register (0x41)
    sensor->status.awb = check_reg_mask(sensor->slv_addr, AAAA_EN, AWB_ENABLE);
    sensor->status.aec = check_reg_mask(sensor->slv_addr, AAAA_EN, AEC_ENABLE);

    // DCW not supported by GC0307
    sensor->status.dcw = 0;

    // Read hmirror and vflip from CISCTL_MODE1 register (0x14)
    sensor->status.hmirror = check_reg_mask(sensor->slv_addr, CISCTL_MODE1, HMIRROR_MASK);
    sensor->status.vflip = check_reg_mask(sensor->slv_addr, CISCTL_MODE1, VFLIP_MASK);

    // Read colorbar status from OUT_CTRL register (0x2e)
    sensor->status.colorbar = check_reg_mask(sensor->slv_addr, OUT_CTRL, 0x01);

    // BPC, WPC not specifically tracked by GC0307 driver
    sensor->status.bpc = 0;
    sensor->status.wpc = 0;

    // Raw GMA, LENC not supported by GC0307
    sensor->status.raw_gma = 0;
    sensor->status.lenc = 0;

    // Quality not supported by GC0307
    sensor->status.quality = 0;

    // Read special effect from SPECIAL_EFFECT register (0x23)
    /*ret = read_reg(sensor->slv_addr, SPECIAL_EFFECT);
    if (ret >= 0) {
        // Map hardware register value to effect enum
        // Bit[1:0] of SPECIAL_EFFECT register holds the effect mode
        uint8_t effect_bits = ret & 0x03;
        if (effect_bits == EFFECT_NORMAL) {
            sensor->status.special_effect = 0; // Normal
        } else if (effect_bits == EFFECT_NEGATIVE) {
            sensor->status.special_effect = 1; // Negative
        } else if (effect_bits == EFFECT_GRAYSCALE) {
            // Could be Grayscale (2) or tint effects (3-6) - requires checking FIXED_CB/CR
            // For simplicity, default to Grayscale when in EFFECT_GRAYSCALE mode
            sensor->status.special_effect = 2; // Grayscale/B&W
        } else {
            sensor->status.special_effect = 0; // Default to Normal
        }
    } else {
        sensor->status.special_effect = 0;
    }*/
	sensor->status.special_effect = 0;

    // Read white balance mode from AWB registers (0x5a-0x5c)
	sensor->status.wb_mode = 0; // Auto WB
    /*if (sensor->status.awb) {
        sensor->status.wb_mode = 0; // Auto WB
    } else {
        // Manual WB - attempt to detect which preset is active by reading gain values
        // Per Linux kernel driver: AWB registers are at 0x5a-0x5c
        int r_gain = read_reg(sensor->slv_addr, AWB_R_GAIN);
        int g_gain = read_reg(sensor->slv_addr, AWB_G_GAIN);
        int b_gain = read_reg(sensor->slv_addr, AWB_B_GAIN);
        if (r_gain >= 0 && g_gain >= 0 && b_gain >= 0) {
            // Match against known presets from Linux kernel driver
            // with tolerance for register variation (+/-4 values)
            if (r_gain >= 0x70 && r_gain <= 0x78 && g_gain >= 0x4e && g_gain <= 0x56 && b_gain >= 0x3c && b_gain <= 0x44) {
                sensor->status.wb_mode = 1; // Sunny/Daylight (0x74, 0x52, 0x40)
            } else if (r_gain >= 0x88 && r_gain <= 0x90 && g_gain >= 0x4c && g_gain <= 0x54 && b_gain >= 0x3c && b_gain <= 0x44) {
                sensor->status.wb_mode = 2; // Cloudy (0x8c, 0x50, 0x40)
            } else if (r_gain >= 0x44 && r_gain <= 0x4c && g_gain >= 0x3c && g_gain <= 0x44 && b_gain >= 0x58 && b_gain <= 0x60) {
                sensor->status.wb_mode = 3; // Office/Incandescent (0x48, 0x40, 0x5c)
            } else if (r_gain >= 0x3c && r_gain <= 0x44 && g_gain >= 0x3e && g_gain <= 0x46 && b_gain >= 0x4c && b_gain <= 0x54) {
                sensor->status.wb_mode = 4; // Home/Fluorescent (0x40, 0x42, 0x50)
            } else {
                sensor->status.wb_mode = 0; // Unknown/custom - default to Auto
            }
        } else {
            sensor->status.wb_mode = 0; // Read error - default to Auto
        }
    }*/

    // AWB gain not specifically tracked
    sensor->status.awb_gain = 0;

    // Read AGC gain from GLOBAL_GAIN register (0x50)
    // Hardware range is 0-63 (6-bit), map to 0-30 for API compatibility
    /*ret = read_reg(sensor->slv_addr, GLOBAL_GAIN);
    if (ret >= 0) {
        // Reverse map from hardware (0-63) to API (0-30)
        sensor->status.agc_gain = (ret * 30) / 63;
        if (sensor->status.agc_gain > 30) sensor->status.agc_gain = 30;
    } else {
        sensor->status.agc_gain = 0;
    }*/
	sensor->status.agc_gain = 0;

    // Read AEC value from EXPOSURE registers (0x03, 0x04)
    // 12-bit value: high byte (0x03) bits[11:4], low byte (0x04) bits[3:0] in upper nibble
    /*int exp_high = read_reg(sensor->slv_addr, EXPOSURE_HIGH);
    int exp_low = read_reg(sensor->slv_addr, EXPOSURE_LOW);
    if (exp_high >= 0 && exp_low >= 0) {
        sensor->status.aec_value = (exp_high << 4) | ((exp_low >> 4) & 0x0F);
        if (sensor->status.aec_value > 1200) sensor->status.aec_value = 1200;
    } else {
        sensor->status.aec_value = 0;
    }*/
	sensor->status.aec_value = 0;

    // AEC2 not supported by GC0307
    sensor->status.aec2 = 0;

